<?php
	/*
		файл ответа на сообщения типа ответ - вопрос
	*/
	
	$autoMessages = array(
		"информация" => "привет, я — игровой чат-бот &#127918;<br>Работаю на основе: GameBot (версия 0.01)<br>Если хочешь, чтобы у тебя был похожий бот, тогда обязательно заходи к нам на GitHub (https://github.com/DenBroShow/GameBot). Удачи :)",
		"тест" => "система работает, всё отлично. &#128295;",
		"привет" => "здравствуй, друг!",
		"как дела" => "отлично, сам как?",
		"что делаешь" => "отвечаю на сообщения, я же бот.",
		"чем занимаешься" => "отвечаю на сообщения, я же бот.",
		"что" => "ничего",
		"чего" => "ничего",
		"да" => "ага",
		"нет" => "омлет",
		"кек" => "лол, орбидол",
		"лол" => "кек, чебурек",
		"помощь" => "помощь по командам бота 'GameBot' &#127918;<br>- баланс (позволяет узнать свой игровой счёт)<br>- игра [ставка] (игра с шансом 50 на 50, либо выиграешь и удвоишь ставку, либо проиграешь)<br>- рандом [от] [до] (получает случайное число в заданном диапазоне)<br>-информация (информация о боте)<br>- вероятность [событие] (вероятность заданного события в процентах)<br>- профиль (ваш профиль в боте)<br>- перевод [ссылка] [сумма] (выполняет перевод монет указанному пользователю)",
		"поц" => "своей маме так скажи, идиот",
		"ты чувак" => "а ти дятел",
		"ты человек" => "я енот",
		"я тебя в очко имел" => "я енот &#127770;",
		"ты даун" => "я ебал твою телку ууу &#10084;",
		"ты даун?" => "гоу ту вэ нахуй, сэр &#128695;",
		"ты поц?" => "я твой батя с усами",
		"ты конь?" => "с украины я, дебил лысый",
		"кто тебя создал?" => "твоя мать",
		"ты серьезно?" => "еще как, а еще я тебя в очко имел",
		"почему?" => "потому что ты неудачник!",
		"ты ебанутый?" => "нет, я не твой батя &#128156;",
		"засранец" => "я бы сказал, что ты насрал в моем подъезде, но я промолчу",
		"ты ебанутый" => "нет, я не твой батя &#128156;",
		"го гулять" => "я долбаеб, поэтому буду деградировать, а ты иди покури, а то от тебя похмельем несет",
		"я тебя люблю" => "а я твоего батю люблю",
		"а меня?" => "тебя я не хочу видеть...",
		"ты любишь меня?" => "нет, у меня есть парень... &#128587;",
		"ты любишь мою семью?" => "нет, у меня есть парень... &#128587;",
		"ты любишь играть в майнкрафт?" => "да, он у меня всегда на рабочем столе",
		"ты любишь читать?" => "нет, я люблю с твоим батей по вечерм гулять",
		"ты хочешь выйти за меня за муж?" => "нет, у меня есть парень... &#128587;",
		"ты хочешь меня?" => "нет, у меня есть парень... &#128587;",
		"ты старик?" => "нет, я игровой ботик",
		"ты старик" => "нет, ты даун кстати",
		"что?" => "что слышал, кусок мусора"
	);
?>